Repository: autohotkey-docs-translation/v2-ja
Catalog: omegat/project_save.tmx
Source language: en
Languages: ja

source: If there is no thread beneath the current thread, the script itself is paused, which prevents timers from running (this effect is the same as having used the menu item "Pause Script" while the script has no threads).
ja: 現在のスレッドの下にスレッドがない場合、スクリプト自体が一時停止され、タイマーの実行が妨げられます（この効果は、スクリプトにスレッドがないときにメニュー項目「スクリプトの一時停止」を使用した場合と同じです）。

source: If there is none, Sleep(0) will not sleep at all.
ja: ない場合は、Sleep(0)は全くスリープしない。

source: If there is only an OK button, clicking the X button is the same as pressing OK.
ja: OKボタンしかない場合は、XボタンをクリックするとOKを押したのと同じになります。

source: If there is only one match, it performs identically to WinGetID.
ja: 一致するものが1つしかないときは、WinGetIDと同じように実行されます。

source: If there is only one matching window, WinActivateBottom behaves identically to WinActivate.
ja: 一致するウィンドウが1つしかない場合、WinActivateBottomはWinActivateと同じ動作をする。

source: If there is text selected in the control, the return value is the column number where the selection begins.
ja: コントロール内でテキストが選択されている場合、戻り値は選択が開始された列番号となる。

source: If there is text selected in the control, the return value is the line number where the selection begins.
ja: コントロール内でテキストが選択されている場合、戻り値は選択が開始された行番号となる。

source: If there were no complications, AutoHotkey is now installed!
ja: ややこしいことがなければ、これでAutoHotkeyのインストールは完了です!

source: If these are the only parameters given with the function, the Last Found Window will be used as the target window.
ja: これらのパラメータだけが関数で与えられた場合、最後に見つかったウィンドウがターゲットウィンドウとして使用されます。

source: If these conditions change after startup completes (for example, the last timer is disabled), the script may exit when the last running thread completes or the last GUI closes.
ja: 起動完了後にこれらの条件が変更された場合（たとえば、最後のタイマーが無効になった場合）、最後に実行されたスレッドが完了するか、最後のGUIが閉じると、スクリプトが終了することがあります。

source: If these happen, try to redesign the pattern to be more restrictive, such as replacing each * with a ?, +, or a limit like {0,3} wherever feasible.
ja: このような場合は、可能な限り * を ?、+、{0,3} のような制限に置き換えるなど、より制限の多いパターンに設計し直すようにしてください。

source: If they cannot be seen -- or if your mouse has more than five buttons that you want to use -- you can try configuring the software that came with the mouse (sometimes accessible in the Control Panel or Start Menu) to send a keystroke whenever you press one of these buttons.
ja: もし見えない場合、あるいはマウスに5つ以上のボタンがある場合、マウスに付属のソフトウェア（コントロールパネルやスタートメニューからアクセスできる場合もあります）を使って、これらのボタンを押すたびにキーストロークを送信するように設定してみてはいかがでしょうか？

source: If they do, there is a high chance that AutoHotkey will not work with that game.
ja: その場合、AutoHotkeyはそのゲームでは動作しない可能性が高いです。

source: If this and the other parameters are all omitted, the RunAs feature will be turned off, which restores Run and RunWait to their default behavior.
ja: このパラメータと他のパラメータをすべて省略した場合、RunAs機能はオフになり、Runと RunWaitはデフォルトの動作に戻ります。

source: If this approach does not work for a particular window, try WinMove.
ja: この方法が特定のウィンドウでうまくいかないときは、WinMoveを試してみてください。

source: If this array is not needed, the parameter name can now be omitted to prevent it from being created:
ja: この配列が不要な場合は、パラメータ名を省略できるようになり、作成されないようになりました：

source: If this directive is unspecified in a script, it will behave as though set to Prompt.
ja: このディレクティブがスクリプトで指定されていないときは、Promptに設定されているとみなされます。

source: If this directive is unspecified in the script, all hotkeys or hotstrings are disabled when the script is suspended, even those which call the Suspend function.
ja: この指令がスクリプトで指定されていない場合、スクリプトが中断されると、すべてのホットキーまたはホットストリングが無効になり、Suspend関数を呼び出すものであっても無効になります。

source: If this directive is unspecified in the script, it will behave as though set to 0.
ja: このディレクティブがスクリプトで指定されていないときは、0に設定されているとみなされます。

source: If this directive is unspecified in the script, it will behave as though set to 1.
ja: このディレクティブがスクリプトで指定されていない場合、1が設定されているものとして動作します。

source: If this directive is unspecified in the script, it will behave as though set to 10.
ja: このディレクティブがスクリプトで指定されていないときは、10に設定されているとみなされます。

source: If this directive is unspecified in the script, it will behave as though set to 1000 (milliseconds).
ja: このディレクティブが指定されないときは、1000（ミリ秒）が設定されたものとして動作します。

source: If this directive is unspecified in the script, it will behave as though set to 1000.
ja: このディレクティブがスクリプトで指定されていない場合、1000に設定されているように動作します。

source: If this directive is unspecified in the script, it will behave as though set to False, meaning the windows API function RegisterHotkey() is used to implement a keyboard hotkey whenever possible.
ja: このディレクティブをスクリプト内で指定しないときは、Falseに設定しているとみなします。これは、可能な限りキーボードホットキーを実装するために、ウィンドウズAPI関数のRegisterHotkey()が使用されることを意味します。

source: If this directive is unspecified in the script, it will behave as though set to False.
ja: このディレクティブがスクリプトで指定されていないときは、Falseに設定されているとみなされます。

source: If this does not begin with the word "AutoHotkey", an error message is shown and the program exits.
ja: 「AutoHotkey」という単語で始まらないときは、エラーメッセージが表示されてプログラムは終了します。

source: If this function is added to an existing script, some or all occurrences of Exit might need to be changed to ExitApp.
ja: 既存のスクリプトにこの機能を追加する場合、Exitの一部または全部をExitAppに変更する必要がある場合があります。

source: If this function is not used, all built-in functions except those documented otherwise (e.g. WinMove and InputBox) use coordinates that are relative to the active window's client area.
ja: この関数を使用しない場合、別に文書化されているもの（WinMoveや InputBoxなど）を除くすべての組み込み関数は、アクティブウィンドウのクライアント領域からの相対座標を使用します。

source: If this function is not used, the default mouse speed is 2.
ja: この機能を使用しない場合、デフォルトのマウススピードは2です。

source: If this function is used in a normal (uncompiled) script, a simple file copy will be performed instead -- this helps the testing of scripts that will eventually be compiled.
ja: この関数を通常の（コンパイルされていない）スクリプトで使用した場合、代わりに単純なファイルコピーが実行されます -- これは、最終的にコンパイルされるスクリプトのテストに役立ちます。

source: If this function times out, it returns the Process ID (PID) of the first matching process that still exists.
ja: この関数がタイムアウトした場合、まだ存在する最初のマッチングプロセスのプロセスID（PID）を返します。

source: If this happens and the interrupting thread takes a long time to finish, the interrupted timer will be effectively disabled for the duration.
ja: このとき、割り込みスレッドが終了するまでに長い時間がかかると、その間、割り込みタイマーは事実上無効となります。

source: If this interferes with the script, or if the script will do its own scaling, the automatic scaling can be disabled.
ja: これがスクリプトの邪魔になる場合、あるいはスクリプトが独自のスケーリングを行う場合は、自動スケーリングを無効にすることができる。

source: If this is a pure integer and VarType is not VT_R4, VT_R8, VT_DATE or VT_CY, its value is used directly; in particular, VT_BSTR, VT_DISPATCH and VT_UNKNOWN can be initialized with a pointer value.
ja: これが純粋な整数で、VarTypeが VT_R4、VT_R8、VT_DATE、VT_CY でない場合、その値が直接使われます。特に VT_BSTR、VT_DISPATCH、VT_UNKNOWN はポインタ値で初期化できる。

source: If this is the case, you cannot directly make that particular key a hotkey because your keyboard driver or hardware handles it at a level too low for AutoHotkey to access.
ja: この場合、キーボードドライバーやハードウェアが、AutoHotkeyがアクセスするには低すぎるレベルで扱うため、その特定のキーを直接ホットキーとすることはできません。

source: If this is the last or only OnClipboardChange function, the return value is ignored.
ja: この関数が最後の、あるいは唯一のOnClipboardChange関数である場合、戻り値は無視されます。

source: If this is the last or only callback, the return value is ignored.
ja: これが最後のコールバックか唯一のコールバックのときは、戻り値は無視されます。

source: If this is the only parameter given, the Last Found Window will be used.
ja: パラメータがこれだけのときは、Last Found Windowが使用されます。

source: If this is undesirable, remove it as follows:
ja: 好ましくない場合は、次のように取り除いてください：

source: If this is undesirable, there are multiple ways it can be avoided:
ja: もしこれが望ましくないのであれば、それを回避する方法は複数あります：

source: If this is undesirable, use Critical.
ja: これが好ましくない場合は、Criticalを使用します。

source: If this is undesired, ensure the file exists before calling IniWrite.
ja: もしこれが望ましくない場合は、IniWriteを呼び出す前にファイルが存在することを確認してください。

source: If this occurs, try specifying the word Alt or Slow in the last parameter.
ja: この場合、最後のパラメータにAltまたはSlowという単語を指定してみてください。

source: If this option is not present, the current user's locale is used to format the string.
ja: このオプションがない場合、現在のユーザーのロケールが文字列の書式に使用されます。

source: If this option is absent, the first icon in the ImageList is used.
ja: このオプションがない場合、ImageListの最初のアイコンが使用される。

source: If this option is not present, x defaults to linefeed (`n).
ja: このオプションがない場合、xのデフォルトは改行（`n）です。

source: If this option is not present, n defaults to 1, which is the position of the first character.
ja: このオプションがない場合、nのデフォルトは1で、これは最初の文字の位置である。

source: If this option is not present, a Text, Picture, GroupBox, CheckBox, Radio, Slider, Tab or Link control initially defaults to the background color set by Gui.BackColor (or if none or other control type, the system's default background color).
ja: このオプションがない場合、Text, Picture, GroupBox, CheckBox, Radio, Slider, Tab または Linkコントロールは、Gui.BackColorで設定された背景色（またはnoneや他のコントロールタイプの場合は、システムのデフォルト背景色）が最初のデフォルトとなります。

source: If this option is not present, the ListView initially defaults to the system's default background color.
ja: このオプションがない場合、ListViewの初期値はシステムのデフォルトの背景色になります。

source: If this option is not present, the TreeView initially defaults to the system's default background color.
ja: このオプションが存在しない場合、TreeViewはシステムのデフォルトの背景色に初期設定されます。

source: If this option is not used, line endings within Text are not changed.
ja: このオプションを使用しない場合、Text内の行末は変更されません。

source: If this option is omitted when adding a menu item, the priority will be 0, which is the standard default.
ja: メニュー項目を追加する際にこのオプションを省略した場合、優先順位は標準のデフォルトである0になります。

source: If this option is omitted, each line except the last will be followed by a linefeed character (`n).
ja: このオプションが省略された場合、最後の行を除く各行の後には改行文字 (`n) が続く。

source: If this option is omitted, the entire file is loaded unless there is insufficient memory, in which case an error message is shown and the thread exits (but Try can be used to avoid this).
ja: このオプションを省略すると、メモリ不足でない限りファイル全体が読み込まれ、その場合はエラーメッセージが表示されてスレッドが終了します（ただし、Tryを使用することでこれを回避できます）。

source: If this or any other (AutoHotkey v1.1.27+) script has a keyboard hook installed, the {Alt up} is blocked from the active window, minimizing the already small risk of side-effects.
ja: このスクリプトまたは他の（AutoHotkey v1.1.27+）スクリプトにキーボードフックがインストールされている場合、{Alt up}はアクティブウィンドウからブロックされ、副作用のリスクを最小限に抑えます。

source: If this parameter is 0 or omitted, the ID number of the first/top item in the TreeView is returned.
ja: このパラメータが0または省略された場合、TreeViewの先頭/トップアイテムのID番号が返される。

source: If this parameter is 0, the ID number of the first/top item in the TreeView is returned.
ja: このパラメータが0である場合、TreeViewの先頭/トップアイテムのID番号が返される。

source: If this parameter is 0, the column header text is retrieved.
ja: このパラメータが 0 の場合、カラムヘッダーテキストが取得されます。

source: If this parameter is 1 (true), the ImageList will contain large icons.
ja: このパラメータが1（true）の場合、ImageListには大きなアイコンが含まれるようになります。

source: If this parameter is 1 (true), the function overwrites existing files.
ja: このパラメータが1（true）の場合、既存のファイルを上書きします。

source: If this parameter is 1 (true), the function waits for data of any kind to appear on the clipboard.
ja: このパラメータが1（true）の場合、この関数はあらゆる種類のデータがクリップボードに表示されるのを待ちます。

source: If this parameter is "CSV", the string will be parsed in standard comma separated value format.
ja: このパラメータが"CSV"の場合、文字列は標準的なカンマ区切り値形式で解析されます。

source: If this parameter is a single file or folder (i.e. no wildcards) and Mode includes R, more than one match will be found if the specified file name appears in more than one of the folders being searched.
ja: このパラメータが単一のファイルまたはフォルダ（すなわちワイルドカードなし）で、ModeにRが含まれる場合、指定されたファイル名が検索対象の複数のフォルダに現れると、複数の一致が検出されます。

source: If this parameter is an object, the value of the object's Ptr property is used.
ja: このパラメータがオブジェクトである場合、オブジェクトのPtrプロパティの値が使用されます。

source: If this parameter is blank or omitted, each character of the input string will be treated as a separate substring.
ja: このパラメータが空白または省略された場合、入力文字列の各文字は個別の部分文字列として扱われます。

source: If this parameter is blank, the function will wait indefinitely for the specified key or mouse/joystick button to be physically released by the user.
ja: このパラメータが空白の場合、指定されたキーまたはマウス/ジョイスティックボタンがユーザーによって物理的に解放されるまで、この関数は無期限に待機することになります。

source: If this parameter is omitted and:
ja: 本パラメータが省略された場合、および

source: If this parameter is omitted or 0 (false), the function is more selective, waiting specifically for text or files to appear ("text" includes anything that would produce text when you paste into Notepad).
ja: このパラメータが省略されるか0（false）の場合、この関数はより選択的に、テキストまたはファイルが現れるのを特別に待ちます（「テキスト」には、メモ帳に貼り付けたときにテキストを生成するようなものも含まれます）。

source: If this parameter is omitted or 1 (true), the window's button in the taskbar will blink.
ja: このパラメータが省略された場合、または1（true）の場合、タスクバーのウィンドウのボタンが点滅します。

source: If this parameter is omitted, all rows in the ListView are deleted.
ja: 本パラメータを省略した場合、ListViewのすべての行が削除されます。

source: If this parameter is omitted, it defaults to the system's default device for playback (which is not necessarily device 1).
ja: このパラメーターが省略された場合、デフォルトはシステムのデフォルト再生デバイス（デバイス1とは限らない）となる。

source: If this parameter is omitted, the AlwaysOn/Off attribute of the key is removed (if present).
ja: このパラメータが省略された場合、キーのAlwaysOn/Off属性が削除される（存在する場合）。

source: If this parameter is omitted, the default search strategy is restored.
ja: このパラメータが省略された場合、デフォルトの検索ストラテジーが復元されます。

source: If this parameter is omitted, the keystrokes will be sent directly to the target window instead of one of its controls (see Automating Winamp for an example).
ja: このパラメータが省略された場合、キー操作はそのコントロールの1つではなく、ターゲットウィンドウに直接送信されます（例として、Winampの自動化を参照）。

source: If this parameter is omitted, the message will be posted directly to the target window rather than one of its controls.
ja: このパラメータが省略された場合、メッセージはターゲットウィンドウのコントロールではなく、ターゲットウィンドウに直接投稿されます。

source: If this parameter is omitted, the message will be sent directly to the target window rather than one of its controls.
ja: このパラメータが省略された場合、メッセージはそのコントロールの1つではなく、ターゲットウィンドウに直接送信されます。

source: If this parameter is omitted, the return value is always a bitmap handle (icons/cursors are converted if necessary).
ja: このパラメータが省略された場合、戻り値は常にビットマップハンドルとなります（必要に応じてアイコン/カーソルは変換されます）。

source: If this parameter is omitted, the target window itself will be clicked.
ja: このパラメータが省略された場合、ターゲットウィンドウ自体がクリックされることになる。

source: If this parameter is specified but the hotstring is disabled from a previous use of this function, the hotstring will remain disabled.
ja: このパラメータを指定しても、以前にこの機能を使用したときにホットストリングが無効になっていた場合は、ホットストリングは無効のままとなります。

source: If this parameter is true and Hwnd identifies a child window which is not a GUI, the function searches for and retrieves its closest parent window which is a GUI.
ja: このパラメータがtrueで、HwndがGUIでない子ウィンドウを識別する場合、関数はGUIである最も近い親ウィンドウを検索して取得します。

source: If this parameter is true, Value has to be an exact match, but not case sensitive.
ja: このパラメータがtrueの場合、Valueは完全一致でなければならないが、大文字と小文字は区別されなません。

source: If this parameter specifies a HWND (as an integer or object), it is not required to be the HWND of a control (child window).
ja: 本パラメータでHWND（整数またはオブジェクト）を指定する場合、コントロール（子ウィンドウ）のHWNDであることは必須ではありません。

source: If this property is not modified, it defaults to the AutoHotkey version used to compile the script.
ja: このプロパティが変更されない場合、スクリプトのコンパイルに使用されたAutoHotkeyのバージョンがデフォルトになります。

source: If this setting is lower than #MaxThreadsPerHotkey, it effectively overrides that setting.
ja: この設定が#MaxThreadsPerHotkeyよりも低い場合、事実上その設定を上書きします。

source: If this setting is not changed by the auto-execute thread, all threads start off as interruptible by timers (though the settings of the Interrupt sub-function [below] will still apply).
ja: この設定が自動実行スレッドによって変更されない場合、すべてのスレッドはタイマーによる割り込みが可能な状態からスタートする（ただし、割り込みサブファンクション[下記]の設定はそのまま適用される）。

source: If this style is not set, only text that fits within the rectangular boundary is enabled.
ja: このスタイルが設定されていない場合、矩形の境界内に収まるテキストのみが有効になる。

source: If this style is not set, the list-view control will unfold partly hidden labels only for the large icon mode.
ja: このスタイルが設定されていない場合、リストビューコントロールはラージアイコンモードでのみラベルの一部が非表示になる。

source: If this translation is not possible (that is, if the current keyboard layout does not contain a key or key combination which produces that character), the character is sent by one of following fallback methods:
ja: この変換が不可能な場合（つまり、現在のキーボードレイアウトにその文字を生成するキーまたはキーの組み合わせがない場合）、その文字は以下のフォールバックメソッドの1つによって送信されます：

source: If this value can be converted to a non-empty string, the standard error dialog displays a line with "Specifically:" followed by this string.
ja: この値が空でない文字列に変換できる場合、標準エラーダイアログは、「Specifically:」の後にこの文字列を含む行を表示します。

source: If this value exceeds 2147483 (24.8 days), it will be set to 2147483.
ja: この値が2147483（24.8日）を超えた場合、2147483に設定されます。

source: If those properties are not present, the parameter count is not verified.
ja: これらのプロパティが存在しない場合、パラメータ数の確認は行われません。

source: If true or omitted, the script will be kept running after all threads have exited, even if none of the other conditions for keeping the script running are met.
ja: trueまたは省略された場合、スクリプトを実行し続けるための他の条件が満たされていない場合でも、すべてのスレッドが終了した後、スクリプトは実行し続けられます。

source: If true, a match can be found anywhere within what the user types (the match can be a substring of the input text).
ja: trueの場合、ユーザーが入力した文字列の範囲内であればどこでもマッチします（マッチするのは入力テキストの部分文字列でもかまいません）。

source: If true, keys and key combinations which do not produce text may trigger hotkeys or be passed on to the active window.
ja: trueの場合、テキストを生成しないキーやキーの組み合わせは、ホットキーのトリガーになったり、アクティブウィンドウに渡されたりすることがあります。

source: If true, keys and key combinations which produce text may trigger hotkeys or be passed on to the active window.
ja: trueの場合、テキストを生成するキーとキーの組み合わせは、ホットキーをトリガーしたり、アクティブウィンドウに渡されることがあります。

source: If true, the icon is frozen.
ja: trueの場合、アイコンはフリーズする。

source: If two variables were specified, the enumerator attempts to call the property's getter to retrieve the value.
ja: 2つの変数が指定された場合、列挙者はプロパティのゲッターを呼び出して値の取得を試みる。

source: If unset or omitted, Needle will be replaced with blank (empty), meaning it will be omitted from the return value.
ja: 未設定または省略された場合、Needleは空白（empty）に置き換えられ、戻り値から省略される。

source: If unset or omitted, String will be sorted in ascending alphabetical order (case-insensitive), using a linefeed (`n) as separator.
ja: 未設定または省略された場合、Stringはアルファベットの昇順でソートされます（大文字小文字は区別されません）。

source: If unset or omitted, each character of the input string will be treated as a separate substring.
ja: 未設定または省略された場合、入力文字列の各文字は個別の部分文字列として扱われる。

source: If unset or omitted, it defaults to "all characters".
ja: 未設定または省略された場合、デフォルトは「すべての文字」である。

source: If unset or omitted, it defaults to -1, which means "no limit".
ja: 未設定または省略された場合、デフォルトは-1で、これは「制限なし」を意味する。

source: If unset or omitted, it defaults to -1, which replaces all occurrences of the pattern found in Haystack.
ja: 未設定または省略された場合、デフォルトは -1 で、Haystackで見つかったパターンのすべての出現回数を置き換えます。

source: If unset or omitted, it defaults to -1.
ja: 未設定または省略された場合、デフォルトは-1である。

source: If unset or omitted, it defaults to 1 (the first icon group in the file).
ja: 未設定または省略された場合、デフォルトは1（ファイル内の最初のアイコングループ）。

source: If unset or omitted, it defaults to 1 (the first tooltip).
ja: 未設定または省略された場合、デフォルトは1（最初のツールチップ）です。

source: If unset or omitted, it defaults to 1, which is usually the part that contains the text of interest.
ja: 未設定または省略された場合、デフォルトは1であり、これは通常、関心のあるテキストを含む部分である。

source: If unset or omitted, it defaults to 150.
ja: 未設定または省略された場合、デフォルトは150。

source: If unset or omitted, it defaults to 50.
ja: 未設定または省略された場合、デフォルトは50。

source: If unset or omitted, it defaults to 523.
ja: 未設定または省略された場合、デフォルトは523となる。

source: If unset or omitted, no characters will be excluded.
ja: 未設定または省略された場合、文字は除外されない。

source: If unset or omitted, no custom sorting will be performed.
ja: 未設定または省略された場合、カスタムソートは行われない。

source: If unset or omitted, no output variable will be used.
ja: 未設定または省略された場合、出力変数は使用されない。

source: If unset or omitted, the current tray icon is used, which is only meaningful for Freeze.
ja: 未設定または省略された場合、現在のトレイアイコンが使用され、フリーズでのみ意味がある。

source: If unset or omitted, the existing tooltip (if any) will be hidden.
ja: 未設定または省略された場合、既存のツールチップ（もしあれば）は隠される。

source: If unset or omitted, the function waits for the status bar to become blank.
ja: 未設定または省略された場合、この関数はステータスバーが空白になるのを待つ。

source: If unset or omitted, the function will wait indefinitely.
ja: 未設定または省略された場合、この関数は無期限に待機する。

source: If unset or omitted, the icon's frozen/unfrozen state remains unchanged.
ja: 未設定または省略された場合、アイコンの凍結/非凍結状態は変更されない。

source: If unset or omitted, the script's current thread will move on to the next statement(s) while the file is playing.
ja: 未設定または省略された場合、スクリプトの現在のスレッドは、ファイルの再生中に次のステートメントに移ります。

source: If unset or omitted, the string is simply copied or measured without any conversion taking place.
ja: 未設定または省略された場合、文字列は変換されずに単にコピーまたは測定される。

source: If unset or omitted, the string is simply copied without any conversion taking place.
ja: 未設定または省略された場合、文字列は変換されずに単にコピーされる。

source: If unset or omitted, the tooltip will be shown near the mouse cursor.
ja: 未設定または省略された場合、ツールチップはマウスカーソルの近くに表示される。

source: If unset, the default delay is 10 for the traditional SendEvent mode and -1 for SendPlay mode.
ja: 未設定の場合、デフォルトの遅延は、従来のSendEventモードでは10、SendPlayモードでは-1です。

source: If unset, the default delay is 20.
ja: 未設定の場合、デフォルトの遅延時間は20です。

source: If unspecified, the click will occur at the horizontal-center of the control.
ja: 未指定の場合、クリックはコントロールの水平方向の中心で行われます。

source: If unspecified, the click will occur at the vertical-center of the control.
ja: 未指定の場合、クリックはコントロールの垂直方向の中心で行われます。

source: If unspecified, the default is 16 milliseconds while Critical is On, and 5 ms while Critical is Off.
ja: 指定がない場合、デフォルトはCriticalがOnのときは16ミリ秒、CriticalがOffのときは5ミリ秒です。

source: If unspecified, the length limit is 1023.
ja: 未指定の場合、長さの上限は1023となります。

source: If used directly inside such a function -- or in global code -- Exit is equivalent to Return.
ja: このような関数の内部で直接使用する場合、またはグローバルコードで使用する場合、ExitはReturnと同等です。

source: If user input previously caused the default button to be temporarily changed, focusing a non-button control does not automatically restore the default highlight to the actual default button.
ja: ユーザー入力によってデフォルトボタンが一時的に変更された場合、ボタン以外のコントロールをフォーカスしても、デフォルトハイライトが実際のデフォルトボタンに自動的に復元されることはありません。

source: If v1.x is installed, a help file for that version may also be present in the root directory.
ja: v1.xがインストールされている場合、そのバージョンのヘルプファイルもルートディレクトリにあるでしょう。

source: If validation is attempted, exceptions may be thrown as a result of querying the method's properties.
ja: バリデーションが試みられた場合、メソッドのプロパティを照会した結果、例外が発生することがあります。

source: If we rename Tick to Call, we can just use this directly instead of this.timer.
ja: Tickを Callに改名すれば、this.timerの代わりにthisを直接使用すればよいです。

source: If you additionally want to prevent a control's shortcut key (underlined letter) from working, disable the control via ControlSetEnabled.
ja: コントロールのショートカットキー（下線文字）を使用できないようにしたいときは、ControlSetEnabledでコントロールを無効化します。

source: If you additionally want to prevent a control's shortcut key (underlined letter) from working, disable the control via GuiCtrl.Enabled := false.
ja: また、コントロールのショートカットキー（下線文字）が効かないようにしたい場合は、GuiCtrl.Enabled := falseでコントロールを無効化します。

source: If you also want to refer to the window by ID, you can assign the result to a variable instead of using it directly in the if statement:
ja: また、IDでウィンドウを参照したい場合は、if文の中で直接使用するのではなく、結果を変数に代入することができます：

source: If you are creating a shortcut to a specific program file, you can append a space and the path of a script (generally enclosed by quote marks) to the shortcut's target.
ja: 特定の実行ファイルへのショートカットを作成するときは、ショートカットのターゲットにスペースとスクリプトのパス（通常は引用符で囲まれています）を追加できます。

source: If you are having issues and you know the game uses DirectX, try the stuff described on the FAQ page.
ja: 問題があり、ゲームがDirectXを使用していることが分かっている場合は、FAQページに記載されていることを試してみてください。

source: If you are installing for all users, you will need to provide administrator consent in the standard UAC prompt that appears (in other words, click Yes).
ja: すべてのユーザー向けにインストールする場合は、表示される標準のUACプロンプトで管理者の同意を得る必要があります（言い換えれば、「はい」をクリックします）。
